{"showCoverPage":true,"bookCover":{"coverDescription":"","coverMedium":{"params":{"decorative":false,"contentName":"Image","expandImage":"Expand Image","minimizeImage":"Minimize Image","file":{"path":"images\/file-65bbf24422727.png","mime":"image\/png","copyright":{"license":"U"},"width":1600,"height":851},"alt":"A three boxes cartoon : in the first box a speaker says at a tribune in a convincing manner : &quot;AI needs to be regulated&quot;. (second box) This speech does not satisfy the audience who throws tomatoes and eggs at him. In the last box, the speaker is an AI who","title":"cartoon by Daniel Stori (turnoff.us, CC:by-nc-sa)"},"library":"H5P.Image 1.1","metadata":{"contentType":"Image","license":"U","title":"Untitled Image"},"subContentId":"9e49a138-5952-471f-8ed7-15aae0d6f51a"}},"chapters":[{"params":{"content":[{"useSeparator":"auto","content":{"params":{"decorative":false,"contentName":"Image","expandImage":"Expand Image","minimizeImage":"Minimize Image","file":{"path":"images\/file-65bbf83cad72c.png","mime":"image\/png","copyright":{"license":"U"},"width":946,"height":757},"alt":"Tintin says to its dog Snowy: &quot;Snowy, leave m alone. I&#039;m trying to train a LORA system on a sdxl and I cannot concentrate!&quot;","title":"Image generated by Pierre-Carl Langlais with sdxl system (https:\/\/www.lebonllm.fr)"},"library":"H5P.Image 1.1","metadata":{"contentType":"Image","license":"U","title":"Untitled Image"},"subContentId":"75d57949-2716-4830-8850-4c0e13fd0ed8"}},{"content":{"params":{"text":"<p>When it comes to Science and particularly \"Open Science\" which is the new paradigm of Science designed to avoid frauds and increase trust in scientific results among the society, tools used should be transparent and reusable enough to let everybody replicate the experiment or the research. Do Large Language Models comply with this ideal? Mainly not because, huge resources are needed to host the datasets and the models used by AI, this kind of thing cannot be done only in somebody's garage. As Cory Doctorow puts it:<\/p>\n\n<p><em>But even the most \"open\" systems can't be independently replicated, due to raw computing requirements. This isn't the fault of the AI industry -- the computational intensity is a fact, not a choice (Doctorow, 2023)<\/em><\/p>\n\n<p>If these systems are demanding much resources it is because they are sometimes very complex to run. At a certain level, the engineers who designed them are unable to explain how they actually process information, so many are the variables taken into account by the algorithm. Is it a real problem for Science?&nbsp;<\/p>\n\n<p>Nevertheless, some universities are trying to run a LLM on their servers. but other bricks (or overalying services) are needed in order to make it work as efficiently as the products that can be found on the marketplace. Even if a LLM is scalable to a University, you will need a moderation system (among other things) to filter prompts by your students. This moderation is part of major players' business such as OpenAI (see Part 5). If ypur University pay expansive subscriptions to these additionnal services, will this cost be sustainable on the long run ? And can we say that Universities remain in this case independant from AI industry leaders or do they reinforce their monopoly?<\/p>\n"},"library":"H5P.AdvancedText 1.1","metadata":{"contentType":"Text","license":"U","title":"Untitled Text"},"subContentId":"b5f90c90-a543-486c-bee6-498e18c96190"},"useSeparator":"auto"}]},"library":"H5P.Column 1.16","subContentId":"6a421651-f65f-4042-89c5-a803b5797b65","metadata":{"contentType":"Column","license":"U","title":"OPENNESS - is AI Open?"}},{"params":{"content":[{"useSeparator":"auto","content":{"params":{"decorative":false,"contentName":"Image","expandImage":"Expand Image","minimizeImage":"Minimize Image","file":{"path":"images\/file-65bc02be89cf1.png","mime":"image\/png","copyright":{"license":"U"},"width":1200,"height":974},"title":"Neural network with dark background, Wikimedia Commons CC:by-sa"},"library":"H5P.Image 1.1","metadata":{"contentType":"Image","license":"U","title":"Untitled Image"},"subContentId":"e8863249-b449-4b1a-93c5-723de1ff85ff"}},{"content":{"params":{"text":"<p>AI are <strong>black boxes<\/strong>. But to some extent, scientists can discuss what data contributed to train the AI. If AI are trained with biased data, whatever be the complex and non interpretable machinery, the output will have poor quality ; as one says : <strong>Garbage In, Garbage Out (GIGO)<\/strong>.<\/p>\n\n<p><em>Most of the time, we don't need to understand the learning algorithm in detail. Nor do we need to understand the workings of the program that the learning algorithm generates. (In so-called deep learning models, no one---including the creators of the algorithm---really understands the workings of the program that algorithm generates.) All you have to do to spot problems is to think about the training data and the labels that are fed into the algorithm. Begin with bad data and labels, and you'll get a bad program that makes bad predictions in return. <\/em>(Bergstrom, 2021)<\/p>\n\n<p>When somebody or some corporation praises the complexity of the algorythm used by their large langage model, you should rather consider with what data this AI was trained. If these data are of poor quality oar biased, the results will be deceiving.<\/p>\n"},"library":"H5P.AdvancedText 1.1","metadata":{"contentType":"Text","license":"U","title":"Untitled Text"},"subContentId":"2cc3a1a2-280e-40a8-9520-223fba6e5f16"},"useSeparator":"auto"}]},"library":"H5P.Column 1.16","subContentId":"20170618-04b9-4a94-bce2-8ba87e6b1737","metadata":{"contentType":"Column","license":"U","title":"TRANSPARENCY - Is AI transparent-enough (especialy for science)?"}},{"params":{"content":[{"useSeparator":"auto","content":{"params":{"decorative":false,"contentName":"Image","expandImage":"Expand Image","minimizeImage":"Minimize Image","alt":"Here the rocket with its components symbolize the different parts of an AI tool. We compare the texts and code based on which the AI is trained to the fuel that allows the rocket to extract from the atmosphere","title":"Wikimedia commons intellectual property","file":{"path":"images\/file-65d4ae475fa3d.png","mime":"image\/png","copyright":{"license":"U"},"width":794,"height":1123}},"library":"H5P.Image 1.1","metadata":{"contentType":"Image","license":"U","title":"Untitled Image"},"subContentId":"a4403e42-99ff-47f0-a642-ec96a0d9cdd1"}},{"content":{"params":{"text":"<p>In february 2024, Microsoft and the New York Times decided to suit OpenAI company whom they suspect to use without their consent their content (newspaper articles for the NYT, software stored in Microsoft's Forge, for the latter) in order to train ChatGPT. <a href=\"https:\/\/www.reuters.com\/technology\/nvidia-is-sued-by-authors-over-ai-use-copyrighted-works-2024-03-10\/\" target=\"_blank\">NVIDIA recently admitted that they had infringed copyright laws to train their LLM called NeMo<\/a>.<\/p>\n\n<p>Commercial publishers invest in digital protections in order to prevent AI to scrape their content, wether in open access or not. Open Access suppose that when you reuse a paper, you mention the source. AI tools use some many sources in so many text chuncks that it is impossible to state which information came from which source.<\/p>\n\n<p>Huge firms such as OpenAI infringe everyday copyright laws, but will fees event reaching hundrers of millions dollars will force these companies to change their practices when so much money is at stake. You may have some doubt on this.<\/p>\n\n<p>In many cases, the question for a scientist today could be sumed up like this : how can I make my publications and my data available for the public good but in the meantime prevent AI big companies to use them and to sell them as training content for chatbots ?<\/p>\n\n<p>In order to help new actors to deploy new AI tools while complying with copyright rules, engineers have launched an initiative called <a href=\"https:\/\/huggingface.co\/blog\/Pclanglais\/common-corpus\" target=\"_blank\">Common Corpus<\/a> : a large public domain dataset aimed at training AI. Maybe the sign that AI industry could soon be more virtuous on the regard of intellectual property?<\/p>\n\n<p>&nbsp;<\/p>\n"},"library":"H5P.AdvancedText 1.1","metadata":{"contentType":"Text","license":"U","title":"Untitled Text"},"subContentId":"3789a9d7-150b-43d8-bc4a-f95ed2b58856"},"useSeparator":"auto"}]},"library":"H5P.Column 1.16","subContentId":"0d3ec312-7fc2-492c-b188-b4703a4b2f43","metadata":{"contentType":"Column","license":"U","title":"INTELLECTUAL PROPERTY - Do AI companies act as pirates?"}},{"params":{"content":[{"useSeparator":"auto","content":{"params":{"decorative":false,"contentName":"Image","expandImage":"Expand Image","minimizeImage":"Minimize Image","file":{"path":"images\/file-65bc99e69fc43.jpg","mime":"image\/jpeg","copyright":{"license":"U"},"width":799,"height":533},"alt":"photograph: students using computers in a university","title":"Microsoft and NASA Space Education Day"},"library":"H5P.Image 1.1","metadata":{"contentType":"Image","license":"U","title":"Untitled Image"},"subContentId":"3d2474c1-ecc7-47b6-9284-2fd502821b3b"}},{"useSeparator":"auto","content":{"params":{"text":"<p>Most of the times, Universities don't really prohibit the use of artificial intelligence by their students, but they impose rules that encourage students to be transparent in their use.<br>\nThere's nothing more irritating when you are a teacher than correcting ChatGPT while you are supposed to e correcting a student's original production.<\/p>\n\n<p>The same problems apply to researchers: artificial intelligences make it possible to dispatch tedious tasks and save time, but no-one is immune to hallucination by these tools, even during simple tasks, and the slightest inexplicable error of these artificial intelligences can have enormous consequences.<\/p>\n\n<p>By the way, automatizing tedious tasks helps to be more productive, but should not we place some limits to this principle of productivity. Are we really productive when we submit on time an assignment made with ChatGPT, full of knowledge that we have not made our own, because we made 0 search un the Library or on the web and except for a prompt, we have not articulate any concept with another. Writing may be considered by some people as a tedious task or at least a difficult one. It's certainly a hard and sensible task because it does not only involve our \"natural intelligence\" (i.e our logic and lexical skills) but ourselves as a whole (in our words lie our identity and our worldview). What happens when we do not write any more, because a bot does it for us ? We stop thinking.<\/p>\n\n<p>the link below sets out contradictory arguments. It's up to you to vote for these arguments. Compare your votes with those of other students who have done this activity.<\/p>\n"},"library":"H5P.AdvancedText 1.1","metadata":{"contentType":"Text","license":"U","title":"Untitled Text"},"subContentId":"72909a10-b32c-4450-bfca-fb17807e6e3f"}},{"content":{"params":{"linkWidget":{"protocol":"https:\/\/","url":"app.klaxoon.com\/join\/FQKQEG5"},"title":"Should Universities ban AI tools"},"library":"H5P.Link 1.3","metadata":{"contentType":"Link","license":"U"},"subContentId":"55db0516-aa91-4f0d-a136-bd2085417be0"},"useSeparator":"auto"},{"useSeparator":"auto"}]},"library":"H5P.Column 1.16","subContentId":"85114f25-409b-47b6-b4c6-20492c584108","metadata":{"contentType":"Column","license":"U","title":"COGNITIVE SKILLS - Should Universities ban AI use by strudents?"}},{"params":{"content":[{"content":{"params":{"decorative":false,"contentName":"Image","expandImage":"Expand Image","minimizeImage":"Minimize Image","file":{"path":"images\/file-65bc00f579d9f.jpg","mime":"image\/jpeg","copyright":{"license":"U"},"width":670,"height":335},"title":"A cross-section of the Turk from Racknitz, showing how he thought the operator sat inside as he played his opponent (Wikipedia, CC0)","alt":"the 18th-century engraving depicts the device developed by Hungarian inventor Wolfgang von Kampelen: a human hidden inside the machine shakes the coins in place of the fake turbaned automaton known as the mechanical Turk."},"library":"H5P.Image 1.1","metadata":{"contentType":"Image","license":"U","title":"Untitled Image"},"subContentId":"c6ec42fa-4531-498b-9a3e-5101ea49a3f2"},"useSeparator":"auto"},{"useSeparator":"auto","content":{"params":{"text":"<p>the stock market valuation of artificial intelligence seems to know no bounds. But, as with other extractive activities, these immense profits depend on the exploitation of cheap foreign labor. In this case, the Times revealed in January 2023 that OpenAI had paid Kenyan moderators less than $2 an hour to make the content used by ChatGPT less toxic.<br>\nThe click workers and other mechanical turks who are so necessary to AI training and often have a high level of education frequently earn less than the local wage for an equivalent number of hours spent working.<br>\nAI is also arriving everywhere in the workplace, and employees generally have no opportunity to oppose it. A time-saving tool, Artificial Intelligence can also sometimes turn into a surveillance tool for the employee, summoned to adapt to the tool when it should be the tool that adapts to the worker.<\/p>\n"},"library":"H5P.AdvancedText 1.1","metadata":{"contentType":"Text","license":"U","title":"Untitled Text"},"subContentId":"e1ca40c0-50bd-48f1-a222-1a41bc72ce7a"}}]},"library":"H5P.Column 1.16","subContentId":"35b0b20f-dfb3-4eb7-b8fc-a7e2d52035d3","metadata":{"contentType":"Column","license":"U","title":"SOCIAL IMPACT - Do AI corporations run sweatshops to moderate the content of their products?"}},{"params":{"content":[{"useSeparator":"auto","content":{"params":{"decorative":false,"contentName":"Image","expandImage":"Expand Image","minimizeImage":"Minimize Image","file":{"path":"images\/file-65bc9da9218fb.png","mime":"image\/png","copyright":{"license":"U"},"width":1024,"height":686},"title":"Jacob Hannah for The New York Times https:\/\/www.nytimes.com\/2015\/08\/03\/nyregion\/documents-reveal-new-york-state-agencys-role-in-adirondacks-mining-proposal.html","alt":"Adirondack Mine"},"library":"H5P.Image 1.1","metadata":{"contentType":"Image","license":"U","title":"Untitled Image"},"subContentId":"7cf19a7a-100c-4e60-90cd-dc79f5c012b6"}},{"useSeparator":"auto","content":{"params":{"text":"<p>To say that artificial intelligence is an extractivist activity means at least two things. On the one hand, it proceeds in the manner of a mining activity, extracting digital traces of our identities and behaviors from the digital lives.<br>\nSecondly, it is inseparable from mining in the most physical sense of the term. To continue developing, the AI-based economy needs to extract more and more rare earths from the ground, destroying landscapes in the process, and discarding anything that cannot be recycled in the form of sludge.<\/p>\n\n<p>Kate Crawford in her book \"Atlas of AI: Power, Politics, and the Planetary Costs of Artificial Intelligence\" published in 2021 explores the two sides of this extractivism on which is based AI industry.<\/p>\n\n<p><br>\nWhat's more, the imposing servers that enable AI to function need water to be cooled (169 liter\/second for a Google Datacenter (Sebastian Lehuédé, 2024). This water, as in Chile, where no public policy on this essential resource exists, can be cruelly lacking for the surrounding populations.<br>\nFinally, training artificial intelligence and then using it on a day-to-day basis consumes a considerable amount of energy and causes higher greenhouse gas emissions than older technologies that remain in service.<\/p>\n\n<p>All these factors should encourage us to use artificial intelligence sparingly. Can we really afford to use them every time?<\/p>\n\n<p>can we really use chatbots everytime we feel the need to use them, or should not we rather ask ourselves if our own intelligence which is far less energy-consuming an much more sophisticated than ChatGPT would not be enough to perform plain tasks, such as writing a text. Writing something for ourselves and for others after all is the best way to test if we have really understood what we are talking about...<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>The link below leads to an activity inspired by the publication of a 2023 preprint. The study tries to measure the cost per inference of popular artificial intelligences of different types. Cost is measured in number of loads for an average smartphone (Luccioni, Yernite et al., 2023). Try to associate each type of AI with its actual energy cost.<\/p>\n"},"library":"H5P.AdvancedText 1.1","metadata":{"contentType":"Text","license":"U","title":"Untitled Text"},"subContentId":"9747b19e-383a-4295-a36a-6d3e2f2b24d6"}},{"content":{"params":{"linkWidget":{"protocol":"https:\/\/","url":"app.klaxoon.com\/join\/RZCK5D3"},"title":"energy costs of different types oAI"},"library":"H5P.Link 1.3","metadata":{"contentType":"Link","license":"U"},"subContentId":"052d23ce-dff4-45b6-a240-52acc274c43a"},"useSeparator":"auto"}]},"library":"H5P.Column 1.16","subContentId":"becd6136-fad2-4f97-aa35-be92cb8fa50c","metadata":{"contentType":"Column","license":"U","title":"ENVIRONMENTAL ISSUES - Is AI the new pipeline (and data the new oil)?"}}],"behaviour":{"baseColor":"#1768c4","defaultTableOfContents":true,"progressIndicators":true,"progressAuto":true,"displaySummary":true,"enableRetry":true},"read":"Read","displayTOC":"Display &#039;Table of contents&#039;","hideTOC":"Hide &#039;Table of contents&#039;","nextPage":"Next page","previousPage":"Previous page","chapterCompleted":"Page completed!","partCompleted":"@pages of @total completed","incompleteChapter":"Incomplete page","navigateToTop":"Navigate to the top","markAsFinished":"I have finished this page","fullscreen":"Fullscreen","exitFullscreen":"Exit fullscreen","bookProgressSubtext":"@count of @total pages","interactionsProgressSubtext":"@count of @total interactions","submitReport":"Submit Report","restartLabel":"Restart","summaryHeader":"Summary","allInteractions":"All interactions","unansweredInteractions":"Unanswered interactions","scoreText":"@score \/ @maxscore","leftOutOfTotalCompleted":"@left of @max interactions completed","noInteractions":"No interactions","score":"Score","summaryAndSubmit":"Summary &amp; submit","noChapterInteractionBoldText":"You have not interacted with any pages.","noChapterInteractionText":"You have to interact with at least one page before you can see the summary.","yourAnswersAreSubmittedForReview":"Your answers are submitted for review!","bookProgress":"Book progress","interactionsProgress":"Interactions progress","totalScoreLabel":"Total score","a11y":{"progress":"Page @page of @total.","menu":"Toggle navigation menu"}}